** Saving the Argument Values in Variables

Now we need to save the values of the two arguments in variables so we can use the values throughout the rest of the program
   
#+name:
#+BEGIN_SRC rust
// used to take in command line args
// returns an iterator of the command like args passed to minigrep
use std::env;

fn main() {
    // collect turns an interator into a collection (like a vector)
    let args: Vec<String> = env::args().collect();
    let query = &args[1];
    let filename = &args[2];

    println!("Searching for:\t{}", query);
    println!("In file:\t{}", filename);
}
#+END_SRC

#+RESULTS: 
: thread 'main' panicked at 'index out of bounds: the len is 1 but the index is 1', src/main.rs:9:18

